float scale = 250;
float thickness = 0.1;//痩せさせる厚さ
//頂点座標 反時計回り
float[] x = {1.7,2,1.9,1.63,1.44,1.62,1.22,1.16,0.84,0.78,0.38,0.56,0.37,0.1,0,0.3,0.37,0.1,0.38,0.56,0.84,0.78,1.22,1.16,1.44,1.62,1.9,1.63};
float[] y = {1,1,1.43,1.3,1.55,1.78,1.97,1.68,1.68,1.97,1.78,1.55,1.3,1.43,1,1,0.7,0.57,0.22,0.45,0.32,0.03,0.03,0.32,0.45,0.22,0.57,0.7};

void setup(){
  size(500, 500);
  Polygon polygon = new Polygon(x, y);
  polygon.show();
  polygon.offset(thickness);
  fill(255, 0, 0, 100);
  polygon.show();
}

void draw(){
  
}